famname = ['김', '이', '박,' '정', '최', '조', '강', '윤', '장', '임',
           '신', '유', '한', '오', '서', '전', '권', '황', '안', '송',
           '홍', '양', '고', '문', '손', '배', '백', '허', '노', '남',
           '심', '하', '주', '구', '곽', '성', '차', '우', '진', '민',
           '류', '나', '지', '엄', '변', '채', '원', '방', '천', '공',
           '현', '함', '여', '염', '석', '추', '도', '소', '설', '선',
           '마', '길', '연', '위', '표', '명', '기', '반', '라', '왕',
           '금', '옥', '육', '인', '맹', '제', '모', '남궁', '탁', '국',
           '어', '경', '은', '편', '용', '예', '봉', '사', '부', '황보',
           '가', '복', '태', '목', '형', '피', '두', '감', '호', '제갈']
youname = ['지우', '서윤', '서준', '민준', '서연', '도윤', '하윤', '시우', '연우', '민서',
           '주원', '지호', '서현', '예준', '지안', '하준', '지민', '하은', '서진', '윤서',
           '지후', '지원', '지유', '도현', '선우', '은우', '준우', '채원', '수아', '지아',
           '준서', '시윤', '지윤', '우진', '건우', '서우', '현우', '하율', '서아', '은서',
           '다은', '지훈', '수현', '하린', '유준', '소율', '수빈', '예은', '시현', '예린',
           '유진', '지율', '현서', '이준', '소윤', '유나', '예원', '민재', '서율', '이안',
           '시은', '채은', '시아', '현준', '정우', '수민', '윤아', '아린', '윤우', '예나',
           '아인', '다온', '아윤', '승현', '예서', '수호', '유주', '시온', '가은', '서하',
           '승우', '유찬', '하진', '이현', '주아', '다인', '유빈', '서영', '지환', '예진',
           '민지', '연서', '준혁', '수연', '채윤', '시후', '율', '승민', '나은', '시연']
def name():
    import random
    family = random.choice(famname)
    yourname = random.choice(youname)
    name_label.config(text = f"{family}{yourname}", font = ("Arial, 20"))
# GUI 코딩
import tkinter as tk
window = tk.Tk()
window.title("랜덤 이름 생성기")
window.geometry("400x240")
name_label = tk.Label(window, text = "이곳에 이름이 출력됩니다.", font = ("Arial, 20"))
name_label.pack()
random_button = tk.Button(window, text = "이름 생성", command = name)
random_button.pack()
window.mainloop()